_posts/2014-08-08-What-we-are-using-org-mode-for.html
---
title: What we are using org-mode for
date: 2014/08/08 13:59:59
updated: 2014/08/08 13:59:59
categories: orgmode
tags: 
---


<p>
About four years ago I picked up Emacs again, because of org-mode. It started as an experiment to see if org-mode might be a solution to managing my growing list of obligations. Since then I have learned alot about org-mode. I was feeling reflective today, so here I describe a few of the things we are doing with it now, besides just organizing my obligations! I have found org-mode useful for many other things.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> This blog</h2>
<div class="outline-text-2" id="text-1">
<p>
Every entry of this blog is written in org-mode and exported to an HTML file (<a href="https://github.com/jkitchin/jmax/blob/master/user/blogofile.el">https://github.com/jkitchin/jmax/blob/master/user/blogofile.el</a> ) that is compiled by blogofile (<a href="http://www.blogofile.com/">http://www.blogofile.com/</a> ). Thanks to some emacs-lisp code, each post has the raw org-file linked to it so you can see exactly how the page was made.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Writing large technical documents/books</h2>
<div class="outline-text-2" id="text-2">
<p>
I used org-mode to write my book on modeling materials properties using density functional theory (<a href="http://kitchingroup.cheme.cmu.edu/dft-book">http://kitchingroup.cheme.cmu.edu/dft-book</a> ). This book has over 100 Python code examples that are integrated with the narrative text, including equations, figures and references.
</p>

<p>
I also used org-mode to write "Python computations in Science and Engineering" (<a href="http://kitchingroup.cheme.cmu.edu/pycse">http://kitchingroup.cheme.cmu.edu/pycse</a> ), which shows that Python can be used extensively for solving scientific and engineering problems.
</p>

<p>
These "books" are not published in any traditional way; their value is in the org-format where the code is executable.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Writing scientific publications</h2>
<div class="outline-text-2" id="text-3">
<p>
The following papers from our group were written in org-mode. The supporting information files all contain embedded org-files with all of the code used to generate figures and analysis, as well as the data to make the papers reproducible and reusable. These papers include both experimental and computational work.
</p>

<ol class="org-ol">
<li>Spencer D. Miller, Vladimir V. Pushkarev, Andrew J. Gellman and John R. Kitchin, Simulating Temperature Programmed Desorption of Oxygen on Pt(111) Using DFT Derived Coverage Dependent Desorption Barriers, Topics In Catalysis, 57(1), 106-117 (2013). <a href="http://link.springer.com/article/10.1007%2Fs11244-013-0166-3">http://link.springer.com/article/10.1007%2Fs11244-013-0166-3</a> 
</li>

<li>Alex Hallenbeck and John R. Kitchin, Effects of O<sub>2</sub> and SO<sub>2</sub> on the Capture Capacity of a Primary-Amine Based Polymeric CO2 Sorbent, I&amp;ECR, 52 (31), 10788-10794 (2013). <a href="http://dx.doi.org/10.1021/ie400582a">http://dx.doi.org/10.1021/ie400582a</a> . 
</li>

<li>Mehta, Prateek; Salvador, Paul; Kitchin, John, Identifying Potential BO<sub>2</sub> Oxide Polymorphs for Epitaxial Growth Candidates", ACS Applied Materials and Interfaces, 6(5), 3630-3639 (2014). <a href="http://pubs.acs.org/doi/full/10.1021/am4059149">http://pubs.acs.org/doi/full/10.1021/am4059149</a> .
</li>

<li>Zhongnan Xu and John R Kitchin, Relating the Electronic Structure and Reactivity of the 3d Transition Metal Monoxide Surfaces, Catalysis Communications, 52, 60-64 (2014),        <a href="http://dx.doi.org/10.1016/j.catcom.2013.10.028">http://dx.doi.org/10.1016/j.catcom.2013.10.028</a> . 
</li>
</ol>

<p>
We have several more papers in progress that are being written in org-mode. We just export the LaTeX manuscript (<a href="https://github.com/jkitchin/jmax/blob/master/ox-manuscript.el">https://github.com/jkitchin/jmax/blob/master/ox-manuscript.el</a> ) and submit it. My students now use org-mode to produce reports for their PhD qualifying exams, MS project reports, and other internal reports I ask them to write. I have used it for writing internal memos and reports for the Department. I occasionally use it to write technical emails.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Writing software</h2>
<div class="outline-text-2" id="text-4">
<p>
I have used org-mode in three serious software development efforts. So far, all of them have been in emacs-lisp.
</p>

<ol class="org-ol">
<li>org-ref is an extension of org-mode that provides deeply integrated citation and referencing in org-mode documents using bibtex as the reference database. The software is written in emacs-lisp, in an org-file, and the source code is tangled out of it. See <a href="https://github.com/jkitchin/jmax/blob/master/org/org-ref.org">https://github.com/jkitchin/jmax/blob/master/org/org-ref.org</a> . The code is about 1700 lines long.
</li>

<li>doi-utils is a smaller package that allows you to download bibtex entries and pdfs from a DOI. See <a href="https://github.com/jkitchin/jmax/blob/master/org/doi-utils.org">https://github.com/jkitchin/jmax/blob/master/org/doi-utils.org</a> 
</li>

<li>org-show is an emacs-lisp package for using org-files to give presentations. See  <a href="https://github.com/jkitchin/jmax/blob/master/org/org-show.org">https://github.com/jkitchin/jmax/blob/master/org/org-show.org</a> . 
</li>
</ol>

<p>
This literate programming approach to writing software is interesting. You can document via narrative text what the software does, and how it works, sometimes as you write the code. I have not used org-mode to write a large Python project yet. I am considering it.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Giving presentations</h2>
<div class="outline-text-2" id="text-5">
<p>
For some examples of using org-show, see:
  a. Org-mode is awesome  <a href="https://www.youtube.com/watch?v=fgizHHd7nOo">https://www.youtube.com/watch?v=fgizHHd7nOo</a> 
  b. Using org-ref <a href="https://www.youtube.com/watch?v=JyvpSVl4_dg">https://www.youtube.com/watch?v=JyvpSVl4_dg</a> 
  c. The org-show show <a href="https://www.youtube.com/watch?v=JZ8RK-R9O_g">https://www.youtube.com/watch?v=JZ8RK-R9O_g</a> 
  d. Scipy 2014: Python in teaching <a href="https://www.youtube.com/watch?v=IsSMs-4GlT8">https://www.youtube.com/watch?v=IsSMs-4GlT8</a> 
  e. Scipy 2013: reproducible research talk in Beamer generated from org-mode  <a href="https://www.youtube.com/watch?v=1-dUkyn_fZA">https://www.youtube.com/watch?v=1-dUkyn_fZA</a> 
</p>

<p>
Presenting from org-mode takes some adjustment, but it really lets you strip something down to what is important, with few distractions!
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Teaching classes</h2>
<div class="outline-text-2" id="text-6">
<p>
The book on dft that I wrote has been used in a graduate course several times. The last time I taught it we actually used the org-file directly in class during lecture, and I had students turn in their assignments with org-mode. That was done on a computer cluster I administer, so everyone had the emacs/org-mode setup I created.
</p>

<p>
This fall I am teaching a graduate MS course in chemical reaction engineering. It will be taught from org-mode. All the notes are in org-mode, all the assignments are in org-mode. Emacs will communicate with a git-server I run that will provide authenticated delivery of course materials and assignments. Grading is all done through org-mode, with the grades stored directly in the assignment files. The source code behind this effort is located for now at <a href="https://github.com/jkitchin/jmax/tree/master/techela">https://github.com/jkitchin/jmax/tree/master/techela</a> . There is no course website; students will run M-x techela, select their course, and the syllabus.org file will be updated and shown, with org-links to get assignments, open lecture notes, etc&#x2026; The students will do all this on their own laptop, with a preinstalled version of <a href="https://github.com/jkitchin/jmax">https://github.com/jkitchin/jmax</a> , Enthought Canopy Python, git, ssh and TeXLive.
</p>

<p>
I am needless to say, very excited to try it!
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Managing obligations</h2>
<div class="outline-text-2" id="text-7">
<p>
And of course, I still use org-mode to manage my daily job responsibilities as a professor:
</p>
<ol class="org-ol">
<li>Running a research group of ~10 PhD and MS students, managing grants, paper deadlines,&#x2026; I share org-files with my students through Dropbox to keep some activities coordinated.
</li>
<li>Teaching classes
</li>
<li>Department, college, university committee duties
</li>
<li>Preparing for professional meetings
</li>
<li>Conference organization
</li>
<li>Keeping track of personal things
</li>
<li>etc&#x2026;
</li>
</ol>

<p>
I just counted the lines of the files in my org-agenda: 
</p>

<div class="org-src-container">

<pre class="src src-sh">wc -l ~/Dropbox/org-mode/*.org
</pre>
</div>

<pre class="example">
    346 /c/Users/jkitchin/Dropbox/org-mode/abet.org
     28 /c/Users/jkitchin/Dropbox/org-mode/advising.org
    854 /c/Users/jkitchin/Dropbox/org-mode/cheme-undergrad-committee.org
    745 /c/Users/jkitchin/Dropbox/org-mode/committees.org
  11187 /c/Users/jkitchin/Dropbox/org-mode/contacts.org
    451 /c/Users/jkitchin/Dropbox/org-mode/department.org
      2 /c/Users/jkitchin/Dropbox/org-mode/email+gnus.org
     91 /c/Users/jkitchin/Dropbox/org-mode/email.org
    611 /c/Users/jkitchin/Dropbox/org-mode/gilgamesh.org
     91 /c/Users/jkitchin/Dropbox/org-mode/gnus.org
      6 /c/Users/jkitchin/Dropbox/org-mode/group.org
    749 /c/Users/jkitchin/Dropbox/org-mode/journal.org
    274 /c/Users/jkitchin/Dropbox/org-mode/lab.org
    352 /c/Users/jkitchin/Dropbox/org-mode/manuscripts.org
    117 /c/Users/jkitchin/Dropbox/org-mode/master.org
   1239 /c/Users/jkitchin/Dropbox/org-mode/meetings.org
    513 /c/Users/jkitchin/Dropbox/org-mode/notes.org
    118 /c/Users/jkitchin/Dropbox/org-mode/org-course.org
    182 /c/Users/jkitchin/Dropbox/org-mode/personal.org
    485 /c/Users/jkitchin/Dropbox/org-mode/prj-doe-early-career.org
    109 /c/Users/jkitchin/Dropbox/org-mode/prj-exxon.org
     25 /c/Users/jkitchin/Dropbox/org-mode/prj-gcep-project.org
     15 /c/Users/jkitchin/Dropbox/org-mode/prj-simonseed.org
     83 /c/Users/jkitchin/Dropbox/org-mode/prj-task-191.org
      8 /c/Users/jkitchin/Dropbox/org-mode/prj-task-203.org
    349 /c/Users/jkitchin/Dropbox/org-mode/prj-task-97-mat.org
    238 /c/Users/jkitchin/Dropbox/org-mode/proposals.org
    378 /c/Users/jkitchin/Dropbox/org-mode/research.org
      7 /c/Users/jkitchin/Dropbox/org-mode/researcher-ids.org
    110 /c/Users/jkitchin/Dropbox/org-mode/reviews.org
    619 /c/Users/jkitchin/Dropbox/org-mode/software.org
    629 /c/Users/jkitchin/Dropbox/org-mode/tasks.org
      2 /c/Users/jkitchin/Dropbox/org-mode/taxes.org
  21013 total
</pre>

<p>
hmm&#x2026; that contacts file is big. My agenda might speed up if I move it out. It is not so slow that it bothers me though. That happens when you dump gmail contacts to org-contacts. That is even after cleaning up all the obviously bad entries!
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Summary</h2>
<div class="outline-text-2" id="text-8">
<p>
There is hardly an area in my work not touched by org-mode these days! 
</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/08/08/What-we-are-using-org-mode-for.org">org-mode source</a><p><p>Org-mode version = 8.2.6</p>